applications/test/dissolutionDBS/calciteCrystalWithHeatBySetLowerK0andEps/constant/chemicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

beta             beta  [0 0 0 0 0 0 0] 1.0;
reactionRate     reactionRate [0 1 -1 0 0 0 0] 0.01;
Yeq              Yeq [0 0 0 0 0 0 0] 0.0;
reactionHeat     reactionHeat [0 2 -2 0 0 0 0] 1e7;

// ************************************************************************* //
