applications/test/dissolutionDBS/calciteCrystalWithHeatBySetLowerK0andEps/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

// startFrom       startTime;
startFrom       latestTime;
startTime       0;

stopAt          endTime;

//endTime         5;

// endTime         1;
endTime         20;

deltaT          0.00001;

writeControl    adjustableRunTime;

// writeInterval   0.2;
writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.99;

maxDeltaT       0.0012;

functions
{
    #includeFunc  residuals
    #includeFunc  minMaxComponents
}

// ************************************************************************* //
